[

    {
            "characterId":1,
            "name":"The Batman",
            "sex":"Male",
            "imgurl":"http://cdn3.darkhorizons.com/wp-content/uploads/2017/07/reeves-the-batman-will-begin-an-arc.jpg",
            "height":"6 ft 3 in",
            "weight":"128 KG",
            "superpowers":"none",
            "ability":"Billionarie, Super Genius, Peak level human Fitness, high technology, Master of 127 hand to hand and weapons combat, Micro Sleeps, Inventor, world's greatest dectective, Master of Stealth, Master of Escapology, Trained to resist Mind control",
            "alter_Ego":"Bruce Wayne",
            "origin":"Human",
            "about":"Batman is the super-hero protector of Gotham City, a man dressed like a bat who fights against evil and strikes terror into the hearts of criminals everywhere. In his secret identity, he assumes the alias of Bruce Wayne, billionaire industrialist and notorious playboy; though 'Bruce Wayne' is technically his real name, this Bruce Wayne is a disguise--that of the man he would have been had his parents not been murdered before his eyes when he was no more than a mere boy. Although Batman possesses no super-human powers, he is one of the world's smartest men and greatest fighters. His physical prowess and technical ingenuity make him an incredibly dangerous opponent. He is also a founding member of the Justice League and the Outsiders. Dick Grayson,the first 'crime orphan' to assume the identity of Robin and be nicknamed 'The Boy Wonder,' who currently uses the alias of Nightwing, is Wayne's hand-picked successor, and they operate simultaneously as part of Batman Incorporated. Batman was created by Bill Finger with Bob Kane, first appearing in Detective Comics #27. (1939) Since then, Batman has been one of the most well-known DC Comics characters rivaling Superman and Wonder Woman, throughout his entire publication history and even in other media. This also extends to his supporting cast and his rogues gallery, not least, as described above, the Joker. ",
            "profilepicimg":"https://nhstrategicmarketing.com/wp-content/uploads/2014/07/batman.jpg"
    },
    
    {
        "characterId":2,
        
        "name":"Superman",
        "sex":"Male",
        "imgurl":"https://www.beyondcomics.com/wp-content/uploads/2016/03/Superman-50-BC-Variant.jpg",
        "height":"6 ft 5 in",
        "weight":"150 KG",
        "superpowers":" Super Strength",
        "ability":" Freeze breath, leaser eyes, X-ray vision, Super hearing, super speed, super strength",
        "alter_Ego":" Clark Kent",
        "origin":"Kryptonian",
        "about":"Superman is the most powerful being on planet Earth, an alien immigrant named Kal-El from the planet Krypton who was raised in Smallville, Kansas, to become an American superhero. Raised with high moral ideals, he uses his incredible strength, speed, flight and various other superpowers to fight evil and protect the innocent. In his civilian identity he is Clark Kent, a mild-mannered reporter working for the Daily Planet in Metropolis. He is a founding member of the Justice League of America and a charter member of the Legion of Super-Heroes in the 30th Century. Superman, also known as the Man of Steel, is one of the most powerful superheroes in the DC Universe. His abilities include incredible super-strength, super-speed, invulnerability, freezing breath, flight, and heat-vision. Born as Kal-El on the dying planet Krypton, his parents Jor-El and Lara sent him in a rocket to the planet Earth where he would be the last surviving member of his race. His rocket was discovered by the kindly Jonathan and Martha Kent, who raised him as their son Clark Kent in the town of Smallville, Kansas. His upbringing provided him with strong moral values, and life-long friends Lana Lang and Pete Ross. In his secret identity he works as a reporter at the Daily Planet in the city of Metropolis. This is where he interacts with his love interest Lois Lane, and his co-workers Perry White and Jimmy Olsen. His greatest nemesis is the brilliant super-villain Lex Luthor. To preserve the memory of his home planet and provide him rest from his double-life and adventures, he maintains a Fortress of Solitude at the North Pole. Superman remains proud of his dual heritage, taking seriously the lessons of his birth-parents and his adopted parents. Although he is an alien to this world, he heavily values his humanity, and fights with conviction for truth, justice, and the American way. There are several other heroes inspired by or directly related to his legacy, including Superboy and Supergirl. He is also a member of the Justice League of America and the Legion of Super-Heroes.",
        "profilepicimg":"https://pre00.deviantart.net/7b96/th/pre/f/2013/183/f/4/man_of_steel_ii_by_archaeopteryx14-d6bpqwo.png"
        
},

{
    "characterId":3,
    
        "name":"Wonder Woman",
        "sex":"Female",
        "imgurl":"https://vignette.wikia.nocookie.net/injusticefanon/images/d/d7/Batman-v-Superman-Wonder-Woman-solo-thumb.jpg/revision/latest?cb=20160415180503",
        "height":"6ft",
        "weight":"70 kg",
        "superpowers":"Super Strength | Demi-God",
        "ability":"The Lasso of Truth, Super Strength, super speed",
        "alter_Ego":"Diana Prince",
        "origin":"Amazonian",
        "about":"Diana is the daughter of Queen Hippolyta, the first child born on Paradise Island in the three thousand year history that the immortal Amazons lived there. The Amazons had been created around 1200 B.C. when the Greek goddesses drew forth the souls of all women who had been murdered by men and placed them on the island. One soul was held back from creation, the one that would be born as Diana. That soul originally belonged to the unborn daughter of the first woman murdered by a man (whom Hippolyta was the reincarnation of). In the late 20th Century, Hippolyta was instructed to mold some clay from the shores of Paradise Island into the form of a baby girl. Six members of the Greek Pantheon then bonded the soul to the clay, giving it life. Each of the six also granted Diana a gift: Demeter, great strength; Athena, wisdom and courage; Artemis, a hunter's heart and a communion with animals; Aphrodite, beauty and a loving heart; Hestia, sisterhood with fire; Hermes, speed and the power of flight. Diana grew up surrounded by a legion of sisters and mothers. When she was a young woman, the gods decreed that the Amazons must send an emissary into Man's World. Queen Hippolyta ordered a contest to be held, but forbade Diana from participating. Diana disobeyed and did so anyway in disguise, easily winning the contest and being named the Amazons' champion. She was given a uniform fashioned from the standard of someone who had visited the island a few decades earlier.Diana did not keep her identity a secret, and she was not at first a 'super-heroine'. Indeed, her character was in many ways that of a babe in the woods, innocent and without guile. Diana spoke only Themyscirian, a combination of classical Greek and Turkish. She had to learn English when she arrived in America, rather than knowing the language intuitively. Nonetheless, Diana was trained as a warrior and had no compunction against using deadly force when called for. She often dealt with war, injustice, inequality, death, and conflicts involving the Olympian Gods.Before embarking on her mission, Diana was given the Lasso of Truth, forged by Hephaestus himself. She was also given the Sandals of Hermes, which allowed her to instantly traverse great distances in seconds. Diana's mission was one of peace, but part of it initially involved defeating a mad plot by Ares to destroy the world. She ventured into the world by starting at Boston. There she met a Harvard professor, Dr. Julia Kapatelis, and her daughter, Vanessa Kapatelis, as well as the Air Force Officers Steve Trevor and Etta Candy. Diana stayed with Julia and Vanessa and over the course of a month or two, she learned to speak English. She was attacked at their home by Decay, one of Ares' minions, and after a battle that spilled out into the streets of Boston she first came to the public's eye and was given the name Wonder Woman. Upon discovering Ares' plan (one that involved causing a nuclear holocaust), Diana managed to foil it, first battling his sons Phobos and Deimos before finally convincing him the error of his ways using her Lasso. After defeating the God of War, Diana returned home for healing at the hands of Poseidon himself.",
        "profilepicimg":"https://static1.squarespace.com/static/51b3dc8ee4b051b96ceb10de/t/53b5514be4b0a379dde53464/1404391758708/"
},
{
     "characterId":4,
    
        "name":"The Flash",
        "sex":"Male",
        "imgurl":"https://vignette.wikia.nocookie.net/marvel_dc/images/b/bd/Flash_Wally_West_0001.jpg/revision/latest?cb=20130711160534",
        "height":"6 ft 1 in",
        "weight":"80 KG",
        "superpowers":"Speedster / Speed Force",
        "ability":" Time Travel, Ultra Speed",
        "alter_Ego":" Barry Allen",
        "origin":"Human",
        "about":"The Flash is the fastest man alive. He is the protector of Central City and Keystone City, fighting against evil using his super-speed and a dedicated sense of heroism. His legacy, the Flash Family, spans throughout history tapping into the enigmatic Speed Force to gain their powers. Jay Garrick was the original Flash of the Golden Age, and a founding member of the Justice Society of America. Barry Allen was the Flash of the Silver Age and a founding member of the Justice League of America. He sacrificed himself to save the universe during the Crisis on Infinite Earths, but was resurrected during Final Crisis. His replacement was Wally West, his nephew and the original Kid Flash, formerly of the Teen Titans. The fourth was Bart Allen, who started his career as Impulse.The Flash was created by Gardner Fox and Harry Lampert in his original incarnation. He first appeared in Flash Comics #1. (1940) The modern version was created by Robert Kanigher, John Broome and Carmine Infantino, after an initial concept by Julius Schwartz. ",
        "profilepicimg":"http://img31.mtime.cn/mg/2013/06/04/153813.73875333.jpg"
},
{
        "characterId":5,
       
           "name":"Green Larntern",
           "sex":"Male",
           "imgurl":"https://vignette.wikia.nocookie.net/marvel_dc/images/b/bd/Hal_Jordan_Earth_1_0001.jpg/revision/latest?cb=20180322202605",
           "height":"6 ft 1 in",
           "weight":"85 kG",
           "superpowers":"Power ring grants:Generation of hard-light constructs,Flight,Force fields",
           "ability":"Trained aircraft pilot",
           "alter_Ego":"Hal Jordan",
           "origin":"Human",
           "about":"Green Lantern is a name that has been used by many characters in the DC Universe, and two distinct franchises. The original during the Golden Age was businessman Alan Scott, who wore a magic power ring that created energy constructs and had to be charged using his mystic lantern. 'Green Lantern' was reimagined in the Silver Age as test pilot Hal Jordan, a member of an intergalactic peacekeeping force called the Green Lantern Corps. The Guardians of the Universe on Oa give these Lanterns rings controlled by willpower, and send them to patrol all 3600 sectors of the known universe. Jordan was said to be a member of the Justice League on Earth-One, and Scott was said to be a member of the Justice Society on Earth-Two. Their timelines were merged during the Crisis on Infinite Earths, and it was explained that Scott's magic ring taps into the Starheart. There have been several other human Green Lanterns of Sector 2814. The brash Guy Gardner and later the architect John Stewart were both originally introduced as replacements for Jordan. Kyle Rayner became the fifth and only Green Lantern when Jordan turned into the evil Parallax and destroyed the Corps during Emerald Twilight. The Corps has since been rebuilt with all Lanterns serving simultaneously. Muslim engineer Simon Baz would become the sixth. PTSD victim Jessica Cruz became the seventh after inheriting the Ring of Volthoom from Power Ring of the Crime Syndicate. The Alan Scott version of Green Lantern was created by Bill Finger and Martin Nodell, first appearing in All-American Comics #16. (1940) The Hal Jordan version was created by John Broome and Gil Kane after an initial concept by Julius Schwartz, first appearing in Showcase #22. Let it be noted that green lantern alan scott is not part of the green lantern corps",
           "profilepicimg":"https://cdn3.whatculture.com/images/2017/01/50bf052d0db197bd-600x400.jpg"
   },
   {
           "characterId":6,
          
              "name":"Aquaman",
              "sex":"Man",
              "imgurl":"http://cdn.collider.com/wp-content/uploads/2018/07/aquaman-movie-jason-momoa-5.jpg",
              "height":"6ft 4 in",
              "weight":"110 KG",
              "superpowers":" Can control Aquatic Life",
              "ability":"Aquatic physiology enhanced strength, speed, endurance, agility, durability, reflexes, and senses.Telepathic control of all aquatic life. Super-fast swimming. Able to speak and understand any language on earth. Utilizes the Trident of Poseidon. Hydrokinesis",
              "alter_Ego":"Arthur Curry",
              "origin":"Human-Atlantean Hybrid Atlantean (some continuities)",
              "about":"Aquaman is the telepathic ruler of Atlantis and the Earth's oceans, an Atlantean with incredible strength and speed as well as the ability to command all sea-life. His unique physiology allows him to survive on land and at the ocean's greatest depths of pressure and temperature. Given the names Orin through his royal heritage and Arthur Curry by his human upbringing, he fights to protect both worlds using his mighty abilities and political influence. He is a founding member of the Justice League of America. ",
              "profilepicimg":"https://vignette.wikia.nocookie.net/injusticegodsamongus/images/3/35/Injustice2Aquaman.jpg/revision/latest?cb=20180606212313"
      },
      {
              "characterId":7,
             
                 "name":"Martian Manhunter",
                 "sex":"Male",
                 "imgurl":"https://vignette.wikia.nocookie.net/superman/images/6/63/MartianManhunter.jpg/revision/latest?cb=20110226231932",
                 "height":"6ft 3 in",
                 "weight":"90 KG",
                 "superpowers":"Superhuman endurance, speed and strength",
                 "ability":"Genius-level intellect, shapeshifting, invisibility, ntangibility, Regenerative healing factor, Flight, Martian nine senses, Plasma beam projection, Telekinesis, Telepathy",
                 "alter_Ego":"Hank Henshaw, John Jones, Gold Hunter",
                 "origin":"Green Martian (Mars)",
                 "about":"Centuries ago on the planet Ma'aleca'andra, the Green Martians known as M'yrnn and Sha'sheen gave birth to twin sons. The bearing of twins was uncommon among the Martian culture, and as such, the first of the twins was named J'onn J'onzz, whose name means /'Light to the Light/' J'onn's brother, however, was born a mutant, bereft of a Martian's innate ability to communicate telepathically. He was named Ma'alefa'ak, whose name means 'Darkness in the Heart.'As an adult, J'onn became a Manhunter (police officer) and married a Martian woman named M'yri'ah. The two established a modest home for themselves beneath the windswept Martian plains and gave birth to a daughter named K'hym.Years passed, and J'onn's brother Ma'alefa'ak grew to despise everything about Martian culture. In an ambitious endeavor to commit full-scale genocide against his own people, he engineered a contagious virus known as H'ronmeer's Curse. The virus reacted to telepathic energy and carried from one Martian to the next whenever they elected to use their psionic powers. The plague responded to a Martian's innate fear of fire, causing them psychosomatic stress so intense, that their bodies and minds would literally burst into flame. J'onn desperately tried to keep his wife and daughter from using their mental gifts, but they were unable to do so, and thus ultimately contracted the virus. K'hym was the first to experience the symptoms, and M'yri'ah followed soon after. J'onn was anguished as he watched his family burning to death before his very eyes. The trauma of the event shattered his psyche, and nearly drove him mad.",
                 "profilepicimg":"https://i.pinimg.com/originals/ea/71/45/ea7145940863906844a087b1f62ad0a7.jpg"
         }
    
]